{
  "layers": [
    {
      "className": "surface-layer",
      "content": "<h1 class='text-center'>CodeWorks 2024 Game Jam</h1><h3>🌟 Theme: Rampant Resources 🌟</h3><p>Participants are required to submit a game based on collecting and using resources. The most important aspect of the hackathon is to find an enjoyable way to keep the user engaged.</p><p>All participants must create a fork of <a href='https://github.com/codeworksacademy/hackathon_summer_2024'>this existing repo</a> to start their projects.</p>"
    },
    {
      "className": "sub-surface-layer",
      "content": "<h3>Participation Rules</h3><ul><li>Teams can consist of 1 to 4 members. Collaboration is encouraged to combine diverse skills and perspectives.</li><li>All projects must be initiated on the day of the event. To ensure a level playing field, participants are not allowed to pre-game or work on their projects before the official start time.</li><li>Participants have the flexibility to choose from various project categories, including software applications, video games, physical prototypes, IoT devices, chatbots, or wearable technology.</li><li>Participants are encouraged to integrate AI technology into their projects to enhance functionality and intelligence. The use of AI technology is not mandatory but highly recommended!</li><li>The hallmark of a hackathon is the theme. All participants should attempt to incorporate related elements into their projects.</li></ul>"
    },
    {
      "className": "underground-layer",
      "content": "<h3>Project Ideas</h3><div class='text-center'><img src='./images/poster.png' /><p><a href='https://tripplejaz.art/' target='_blank'>Example Poster - Art by tripplejaz</a></p></div><ul><li>A resource management game where players collect and manage resources to build and upgrade structures.</li><li>An adventure game where players gather resources to survive and progress through levels.</li><li>A strategy game where players use resources to build and command armies.</li><li>A puzzle game where players must collect resources in specific patterns to solve challenges.</li></ul><h3>Tech Stack</h3><p>The tech stack is open. Participants can use any or no game engine. The use of AI is allowed and encouraged.</p><h3>Game Resources</h3><ul><li><a href='https://unity.com/'>Unity</a></li><li><a href='https://www.unrealengine.com/'>Unreal Engine</a></li><li><a href='https://www.godotengine.org/'>Godot Engine</a></li><li><a href='https://phaser.io/'>Phaser</a></li><li><a href='https://threejs.org/'>Three.js</a></li></ul>"
    },
    {
      "className": "cave-layer",
      "content": "<h2>Schedule of Events</h2><h3>📅 July 8 - 12: Coding Week</h3><p>Campus Access: The CodeWorks campus will be open daily from 9:00 AM to 5:00 PM for participants to collaborate and work on their projects.</p><p>Each day, check our website for surprise updates and additional challenges to boost your creativity.</p><h2>📅 July 13: Grand Finale</h2><p>Join us for a live, in-person event at the CodeWorks campus from 9:00 AM to 9:00 PM. Experience the thrill of live judging, fun activities, and exciting giveaways!</p><h3>Judging Criteria</h3><ul><li>Creativity: The uniqueness and creativity of the project. Is this a project we have seen before? A familiar project with an interesting twist or something truly unique.</li><li>Technical Excellence: The technical prowess and complexity of the project, including its implementations of other technologies and assets.</li><li>Presentation: The clarity, effectiveness, enthusiasm, and overall polish displayed during the project presentation. Presentations should cover the core features of the project in a clear and engaging way.</li><li>Adherence to Theme: How well the project aligns with the theme and captures the essence of the hackathon. The incorporation of any revealed secrets.</li><li>User Experience: How does this project maintain user engagement? Could its features be used practically? What is the general user experience while using the project?</li></ul>"
    },
    {
      "className": "core-layer",
      "content": "<h2>Community Guidelines</h2><ul><li>Participants are expected to maintain a respectful and inclusive environment throughout the hackathon. Any form of discrimination, harassment, or disruptive behavior will not be tolerated.</li><li>Participants retain ownership of their project's intellectual property. However, organizers may request the use of project details for promotional purposes.</li><li>All projects must be submitted before the specified deadline at the end of the hackathon. Late submissions may not be considered for judging.</li></ul>"
    }
  ]
}